cask_args appdir: '/Applications'
tap 'caskroom/cask'
tap 'puma/puma'
# tap 'homebrew/php'

brew 'ctop'
brew 'curl'
brew 'ghq'
brew 'gist'
brew 'git'
brew 'htop'
brew 'hub'
brew 'jq'
brew 'mackup'
brew 'mas'
brew 'openssl'
brew 'peco'
brew 'puma/puma/puma-dev'
brew 'rmtrash'
brew 'sshrc'
brew 'telnet'
brew 'tig'
brew 'tree'
brew 'z'
brew 'zsh-completions'
brew 'zsh'

# brew 'automake'
# brew 'cmake'
# brew 'ctags'
# brew 'gcc'
# brew 'go'
# brew 'heroku'
# brew 'memcached'
# brew 'mongodb'
# brew 'mysql'
# brew 'node'
# brew 'nodenv'
# brew 'postgresql'
# brew 'pyenv-virtualenv'
# brew 'pyenv'
# brew 'python'
# brew 'rbenv'
# brew 'readline'
# brew 'redis'
# brew 'ruby-build'
# brew 'sqlite'
# brew 'v8'
# brew 'yarn'

cask 'alfred'
cask 'appcleaner'
# cask 'atom'
cask 'bartender'
cask 'bitbar'
cask 'caffeine'
cask 'cyberduck'
# cask 'dash'
cask 'docker'
cask 'fantastical'
cask 'github'
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'grandperspective'
cask 'gyazo'
cask 'iterm2'
cask 'karabiner-elements'
cask 'keycastr'
cask 'ngrok'
cask 'paw'
cask 'postico'
cask 'sequel-pro'
# cask 'skype'
cask 'transmission'
# cask 'vagrant'
# cask 'vagrant-manager'
# cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'

mas 'Airmail 3', id: 918858936
mas 'Bandwidth+', id: 490461369
mas 'Be Focused Pro', id: 961632517
mas 'BetterSnapTool', id: 417375580
mas 'Bluetooth MIDI Connect', id: 1074606480
# mas 'Growl', id: 467939042
# mas 'Keynote', id: 409183694
mas 'LanScan', id: 472226235
# mas 'LINE', id: 539883307
mas 'Night Owl', id: 428834068
mas 'Skitch', id: 425955336
# mas 'Slack', id: 803453959
mas 'The Unarchiver', id: 425424353
mas 'Todoist', id: 585829637
# mas 'Twitter', id: 409789998
mas 'Wireless Signal', id: 582840059
