cask_args appdir: '/Applications'
tap 'caskroom/cask'

brew 'ag'
brew 'automake'
brew 'cmake'
brew 'ctags'
brew 'curl'
brew 'duti'
brew 'ffmpeg'
brew 'gcc'
brew 'ghq'
brew 'gist'
brew 'git'
brew 'go'
brew 'heroku'
brew 'htop'
brew 'hub'
brew 'imagemagick'
brew 'jq'
brew 'libtool'
brew 'mackup'
brew 'mas'
brew 'memcached'
# brew 'mongodb'
brew 'mysql'
brew 'nginx'
brew 'nodejs'
brew 'nodenv'
brew 'openssl'
brew 'peco'
brew 'postgresql'
brew 'pyenv-virtualenv'
brew 'pyenv'
brew 'rbenv'
brew 'readline'
brew 'redis'
brew 'rmtrash'
brew 'ruby-build'
brew 'sqlite'
brew 'sshrc'
brew 'tig'
brew 'tree'
brew 'v8'
brew 'yarn'
brew 'z'
brew 'zsh-completions'
brew 'zsh'

# cask 'alfred'
cask 'appcleaner'
cask 'atom'
cask 'bartender'
cask 'bitbar'
cask 'caffeine'
cask 'cyberduck'
cask 'dash'
cask 'docker'
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'grandperspective'
cask 'gyazo'
cask 'iterm2'
cask 'keycastr'
cask 'postico'
cask 'sequel-pro'
cask 'skype'
cask 'totalspaces'
cask 'transmission'
cask 'vagrant'
cask 'vagrant-manager'
cask 'virtualbox'
# cask 'visual-studio-code'
cask 'vlc'

mas 'Airmail 3', id: 918858936
mas 'Bandwidth+', id: 490461369
mas 'Be Focused Pro', id: 961632517
mas 'BetterSnapTool', id: 417375580
mas 'Bluetooth MIDI Connect', id: 1074606480
mas 'Growl', id: 467939042
mas 'LanScan', id: 472226235
mas 'LINE', id: 539883307
mas 'Night Owl', id: 428834068
mas 'Skitch', id: 425955336
mas 'Slack', id: 803453959
mas 'The Unarchiver', id: 425424353
mas 'Twitter', id: 409789998
mas 'Wireless Signal', id: 582840059
